АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/алк_ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетовОперативный/алк_ПараметрыПакетовОперативный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетовОперативный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.алк_ЗаказНаПроизводство</types>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопАналитика</name>
    <type>
      <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <resources>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Актуальность</name>
    <type>
      <types>EnumRef.алк_ОперативнаяАктуальностьПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// Выполняет контроль возникновения отрицательных остатков.
	//
	Процедура ВыполнитьКонтроль(ДокументСсылкаПеремещениеЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
		
		Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
		
	КонецПроцедуры //ВыполнитьКонтроль()
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК Ячейка,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации КАК Операция,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ШтабельПолучатель КАК Штабель
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Ячейка КАК Ячейка,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации КАК Операция,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Штабель
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Движение) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_Пакеты
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Ячейка КАК Ячейка,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоСостав КАК Количество,
		|	алк_ПеремещениеЗапасовЗапасы.Объем
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Пакеты.СерийныйНомер
		|					ИЗ
		|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПеремещениеЗапасов.Дата);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		
		//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства  
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УПП
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство Тогда
			
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСкладыСерии", МассивРезультатов[1].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", МассивРезультатов[0].Выгрузить());
			
			Если ДокументСсылкаПеремещениеЗапасов.Направление = Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда
			
				СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[4].Выгрузить());	
			
			КонецЕсли; 
		 		

		ИначеЕсли ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство 
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки 
			Или ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства Тогда
			
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСкладыСерии", МассивРезультатов[0].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", МассивРезультатов[1].Выгрузить());
		
		ИначеЕсли ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПереупаковку Тогда 
			
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", МассивРезультатов[1].Выгрузить());
			
		ИначеЕсли ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение
			ИЛИ ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда 
			
			ТаблицаЗапасыНаСкладахСерии = МассивРезультатов[0].Выгрузить();
			ТаблицаРасход = МассивРезультатов[1].Выгрузить();
			
			Для каждого СтрокаТЗ Из ТаблицаРасход Цикл 
				ЗаполнитьЗначенияСвойств(ТаблицаЗапасыНаСкладахСерии.Добавить(), СтрокаТЗ) 
			КонецЦикла;                 		
			
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", ТаблицаЗапасыНаСкладахСерии);
		
		КонецЕсли; 
		
		// Серийные номера
		РезультатЗапроса2 = МассивРезультатов[2].Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", РезультатЗапроса2);
		Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", РезультатЗапроса2);
		Иначе
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
		КонецЕсли;
		
		СформироватьТаблицаЗапасыОрганизацииСерии(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаДокументыПослПродукция(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		СформироватьТаблицаОстаткиНезавершенногоПроизводства(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаПеремещениеЗапасов.Дата) Тогда
			СформироватьТаблицуПроизводствоОборот(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
			//СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
			ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
		КонецЕсли;
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	КонецПроцедуры
	                                                                                             	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаЗапасыОрганизацииСерии(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПроизводство) КАК Операция,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК Ячейка,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Период", РфпСервер.ПериодПроведения(ДокументСсылкаПеремещениеЗапасов));
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизацииСерии", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизацииСерии
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаОстаткиНезавершенногоПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства)
		
		ЗначенияРеквизитовСборкаЗапасов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "СтруктурнаяЕдиница, СтруктурнаяЕдиницаПолучатель, ВидОперации");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
		|	&ВидДвижения КАК ВидДвижения,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация КАК Организация,
		|	&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоСостав КАК Количество,
		|	алк_ПеремещениеЗапасовЗапасы.Объем
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						Документ.алк_ПеремещениеЗапасов.Запасы КАК ВТ
		|					ГДЕ
		|						ВТ.Ссылка = &Ссылка)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка";	
		
		Если ЗначенияРеквизитовСборкаЗапасов.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство тогда
			Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЗначенияРеквизитовСборкаЗапасов.СтруктурнаяЕдиницаПолучатель);
		Иначе
			Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
			Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЗначенияРеквизитовСборкаЗапасов.СтруктурнаяЕдиница);
		КонецЕсли;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНезавершенногоПроизводства", РезультатЗапроса.Выгрузить());
		
	КонецПроцедуры
		
	// Формирует таблицу значений, содержащую данные для проведения по регистру алк_ПроизводствоОборот.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//Дубоделов Э.А 08.02.23
	Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыСерийныхНомеров.Дата КАК Дата,
		|	ПериодыСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&ПериодыСерийныхНомеров КАК ПериодыСерийныхНомеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(вт.Дата, алк_ПеремещениеЗапасов.Дата) КАК Дата,
		|	алк_ПеремещениеЗапасов.ДатаСмены КАК ДатаСмены,
		|	алк_ПеремещениеЗапасов.Смена КАК Смена,
		|	алк_ПеремещениеЗапасов.Организация КАК Организация,
		|	алк_ПеремещениеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеЗапасов.Штабель КАК Штабель,
		|	алк_ПеремещениеЗапасов.ШтабельПолучатель КАК ШтабельПолучатель,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат КАК Сертификат,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
		|			ТОГДА алк_ПеремещениеЗапасовЗапасы.КоличествоСостав / 1000
		|		ИНАЧЕ алк_ПеремещениеЗапасовЗапасы.Объем
		|	КОНЕЦ КАК Объем,
		|	алк_ПеремещениеЗапасов.ВидОперации КАК ВидОперации,
		|	алк_ПеремещениеЗапасов.Участок КАК Участок
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов КАК алк_ПеремещениеЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|			ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|			ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = вт.СерийныйНомер
		|		ПО алк_ПеремещениеЗапасов.Ссылка = алк_ПеремещениеЗапасовЗапасы.Ссылка
		|ГДЕ
		|	алк_ПеремещениеЗапасов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Перемещения.Дата КАК Период,
		|	NULL КАК Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		|	ВТ_Перемещения.ДатаСмены КАК ДатаСмены,
		|	ВТ_Перемещения.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеРасход) КАК Операция,
		|	ВТ_Перемещения.Организация КАК Организация,
		|	ВТ_Перемещения.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_Перемещения.Сертификат КАК Сертификат,
		|	ВТ_Перемещения.СтруктурнаяЕдиница КАК Склад,
		|	ВТ_Перемещения.Смена КАК Смена,
		|	ВТ_Перемещения.Штабель КАК Штабель,
		|	ВТ_Перемещения.Участок КАК Участок,
		|	ВТ_Перемещения.Характеристика КАК Характеристика,
		|	ВТ_Перемещения.Объем КАК Количество
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Перемещения.Дата,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
		|	ВТ_Перемещения.ДатаСмены,
		|	ВТ_Перемещения.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход),
		|	ВТ_Перемещения.Организация,
		|	ВТ_Перемещения.СерийныйНомер,
		|	ВТ_Перемещения.Сертификат,
		|	ВТ_Перемещения.СтруктурнаяЕдиницаПолучатель,
		|	ВТ_Перемещения.Смена,
		|	ВТ_Перемещения.ШтабельПолучатель,
		|	ВТ_Перемещения.Участок,
		|	ВТ_Перемещения.Характеристика,
		|	ВТ_Перемещения.Объем
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|ГДЕ
		|	ВТ_Перемещения.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки)
		|	И ВТ_Перемещения.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства)";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
		Запрос.УстановитьПараметр("ПериодыСерийныхНомеров", РфпСервер.ПолучитьПоследнийПериодПакета(ДокументСсылкаПеремещениеЗапасов
		,ДокументСсылкаПеремещениеЗапасов.Дата,ДокументСсылкаПеремещениеЗапасов.ДатаСмены,ДокументСсылкаПеремещениеЗапасов.Смена
		,ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница,ДокументСсылкаПеремещениеЗапасов.Штабель
		,ДокументСсылкаПеремещениеЗапасов.Запасы.Выгрузить(),ДокументСсылкаПеремещениеЗапасов.Участок));
		
		ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаРезультата);
		
	КонецПроцедуры
	
	
	Процедура ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылка, ДополнительныеСвойства)
		
		// перенесено из нового перемещения
		
		// В запросе перемещения из производства ЦЛП (со склада "Буферный склад ЦЛП") устанавливается период для каждого пакета.
		// если пакет выпущен/перемещен в пределах смены к которой относится перемещение, 
		// то данное перемещение двигает пакет после его последнего движения (+1 секунда).
		// Если движения были за границами смены документа, устанавливается время документа.
		// Применяется только для пакетированной продукции, для непакетированной устанавливается время документа.
		
		//#Область ЗапросПеремещениеИзПроизводстваЦЛП
		//
		//ЗапросПеремещениеИзПроизводстваЦЛП = 
		//
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
		//|	ВЫБОР
		//|		КОГДА алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена.Код = ""000000001""
		//|			ТОГДА ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 8 * 3600)
		//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 20 * 3600)
		//|	КОНЕЦ КАК ДатаНачалаСмены,
		//|	ВЫБОР
		//|		КОГДА алк_ПеремещениеЗапасовЗапасы.Ссылка.Смена.Код = ""000000001""
		//|			ТОГДА ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 20 * 3600 - 1)
		//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасовЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 32 * 3600 - 1)
		//|	КОНЕЦ КАК ДатаКонцаСмены,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СкладОтправитель
		//|ПОМЕСТИТЬ ВТ_Пакеты
		//|ИЗ
		//|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		//|ГДЕ
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Ссылка = &ДокументСсылка
		//|	И НЕ алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВТ_Пакеты.СерийныйНомер,
		//|	ВТ_Пакеты.ДатаДокумента,
		//|	ВТ_Пакеты.ДатаНачалаСмены,
		//|	ВТ_Пакеты.ДатаКонцаСмены,
		//|	алк_ОстаткиЗапасовОбороты.Период,
		//|	ВЫБОР
		//|		КОГДА алк_ОстаткиЗапасовОбороты.Период МЕЖДУ ВТ_Пакеты.ДатаНачалаСмены И ВТ_Пакеты.ДатаКонцаСмены
		//|			ТОГДА алк_ОстаткиЗапасовОбороты.Период
		//|		ИНАЧЕ ВТ_Пакеты.ДатаДокумента
		//|	КОНЕЦ КАК Дата
		//|ПОМЕСТИТЬ ВТ_ДатыПакетов
		//|ИЗ
		//|	ВТ_Пакеты КАК ВТ_Пакеты
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		//|				ДОБАВИТЬКДАТЕ(&КонецСмены, ЧАС, -24),
		//|				&КонецСмены,
		//|				Регистратор,
		//|				(СерийныйНомер, СтруктурнаяЕдиница) В
		//|					(ВЫБРАТЬ
		//|						ВТ_Пакеты.СерийныйНомер,
		//|						ВТ_Пакеты.СкладОтправитель
		//|					ИЗ
		//|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ОстаткиЗапасовОбороты
		//|		ПО ВТ_Пакеты.СерийныйНомер = алк_ОстаткиЗапасовОбороты.СерийныйНомер
		//|ГДЕ
		//|	алк_ОстаткиЗапасовОбороты.Регистратор <> &ДокументСсылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_ДатыПакетов.СерийныйНомер,
		//|	МАКСИМУМ(ВТ_ДатыПакетов.Дата) КАК Дата
		//|ПОМЕСТИТЬ ВТ_ДатаИтог
		//|ИЗ
		//|	ВТ_ДатыПакетов КАК ВТ_ДатыПакетов
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_ДатыПакетов.СерийныйНомер
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	алк_ОстаткиЗапасов.Период,
		//|	алк_ОстаткиЗапасов.ВидДвижения,
		//|	алк_ОстаткиЗапасов.Организация,
		//|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		//|	алк_ОстаткиЗапасов.Штабель,
		//|	алк_ОстаткиЗапасов.Номенклатура,
		//|	алк_ОстаткиЗапасов.Характеристика,
		//|	алк_ОстаткиЗапасов.Сертификат,
		//|	алк_ОстаткиЗапасов.СерийныйНомер,
		//|	алк_ОстаткиЗапасов.Количество
		//|ПОМЕСТИТЬ ВТ_Движения
		//|ИЗ
		//|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		//|ГДЕ
		//|	ЛОЖЬ
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата,
		//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Штабель,
		//|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		//|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		//|	алк_ПеремещениеЗапасовЗапасы.Сертификат,
		//|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		//|	алк_ПеремещениеЗапасовЗапасы.Объем
		//|ИЗ
		//|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		//|ГДЕ
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &ДокументСсылка
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата,
		//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ШтабельПолучатель,
		//|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		//|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		//|	алк_ПеремещениеЗапасовЗапасы.Сертификат,
		//|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		//|	алк_ПеремещениеЗапасовЗапасы.Объем
		//|ИЗ
		//|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		//|ГДЕ
		//|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &ДокументСсылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВЫБОР
		//|		КОГДА ВТ_ДатаИтог.Дата ЕСТЬ NULL
		//|			ТОГДА ВТ_Движения.Период
		//|		КОГДА ВТ_ДатаИтог.Дата = &КонецСмены
		//|			ТОГДА ВТ_ДатаИтог.Дата
		//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ДатаИтог.Дата, СЕКУНДА, 1)
		//|	КОНЕЦ КАК Период,
		//|	ВТ_Движения.ВидДвижения КАК ВидДвижения,
		//|	ВТ_Движения.Организация,
		//|	ВТ_Движения.СтруктурнаяЕдиница,
		//|	ВТ_Движения.Штабель,
		//|	ВТ_Движения.Номенклатура,
		//|	ВТ_Движения.Характеристика,
		//|	ВТ_Движения.Сертификат,
		//|	ВТ_Движения.СерийныйНомер,
		//|	ВТ_Движения.Количество
		//|ИЗ
		//|	ВТ_Движения КАК ВТ_Движения
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаИтог КАК ВТ_ДатаИтог
		//|		ПО ВТ_Движения.СерийныйНомер = ВТ_ДатаИтог.СерийныйНомер
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ВидДвижения УБЫВ,
		//|	Период";	
		//
		//#КонецОбласти
		
		#Область ЗапросПеремещение
		
		ЗапросПеремещение = 
		
		"ВЫБРАТЬ
		|	ПериодыСерийныхНомеров.Дата КАК Дата,
		|	ПериодыСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&ПериодыСерийныхНомеров КАК ПериодыСерийныхНомеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Период КАК Период,
		|	алк_ОстаткиЗапасов.ВидДвижения КАК ВидДвижения,
		|	алк_ОстаткиЗапасов.Организация КАК Организация,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель КАК Штабель,
		|	алк_ОстаткиЗапасов.Номенклатура КАК Номенклатура,
		|	алк_ОстаткиЗапасов.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасов.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасов.Количество КАК Количество
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(вт.Дата, алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Штабель,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		|	алк_ПеремещениеЗапасовЗапасы.Сертификат,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.Объем
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = вт.СерийныйНомер
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(вт.Дата, алк_ПеремещениеЗапасовЗапасы.Ссылка.Дата),
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка.ШтабельПолучатель,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		|	алк_ПеремещениеЗапасовЗапасы.Сертификат,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.Объем
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = вт.СерийныйНомер
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &ДокументСсылка";	
		
		#КонецОбласти
		
		Запрос = новый запрос();
		
		//Если ДокументСсылка.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства 
		//	Или ДокументСсылка.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда  		
		//	Запрос.Текст = ЗапросПеремещениеИзПроизводстваЦЛП;  
		//Иначе
			Запрос.Текст = ЗапросПеремещение;		
		//КонецЕсли;
		
		ВремяСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(ДокументСсылка.Смена, ДокументСсылка.ДатаСмены);
		
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
		Запрос.УстановитьПараметр("КонецСмены", ВремяСмены.ДатаВремяКонцаСмены);
		Запрос.УстановитьПараметр("ПериодыСерийныхНомеров", РфпСервер.ПолучитьПоследнийПериодПакета(ДокументСсылка
		,ДокументСсылка.Дата,ДокументСсылка.ДатаСмены,ДокументСсылка.Смена
		,ДокументСсылка.СтруктурнаяЕдиница,ДокументСсылка.Штабель
		,ДокументСсылка.Запасы.Выгрузить(),ДокументСсылка.Участок));
	
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаДвижений);
		
	КонецПроцедуры
	
	
	
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру алк_ОстаткиЗапасов.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//Дубоделов Э.А 08.02.23
	//Процедура СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	//	
	//	Запрос = Новый  Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ПериодыСерийныхНомеров.Дата КАК Дата,
	//	|	ПериодыСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
	//	|ПОМЕСТИТЬ вт
	//	|ИЗ
	//	|	&ПериодыСерийныхНомеров КАК ПериодыСерийныхНомеров
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вт.Дата КАК Дата,
	//	|	алк_ПеремещениеЗапасов.ВидОперации КАК ВидОперации,
	//	|	алк_ПеремещениеЗапасов.ДатаСмены КАК ДатаСмены,
	//	|	алк_ПеремещениеЗапасов.Смена КАК Смена,
	//	|	алк_ПеремещениеЗапасов.Организация КАК Организация,
	//	|	алк_ПеремещениеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|	алк_ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	//	|	алк_ПеремещениеЗапасов.Штабель КАК Штабель,
	//	|	алк_ПеремещениеЗапасов.ШтабельПолучатель КАК ШтабельПолучатель,
	//	|	алк_ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	//	|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	//	|	алк_ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
	//	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат КАК Сертификат,
	//	|	ВЫБОР
	//	|		КОГДА алк_ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	//	|			ТОГДА алк_ПеремещениеЗапасовЗапасы.КоличествоСостав / 1000
	//	|		ИНАЧЕ алк_ПеремещениеЗапасовЗапасы.Объем
	//	|	КОНЕЦ КАК Объем
	//	|ПОМЕСТИТЬ ВТ_Перемещения
	//	|ИЗ
	//	|	Документ.алк_ПеремещениеЗапасов КАК алк_ПеремещениеЗапасов
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
	//	|			ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	//	|			ПО алк_ПеремещениеЗапасовЗапасы.СерийныйНомер = вт.СерийныйНомер
	//	|		ПО алк_ПеремещениеЗапасов.Ссылка = алк_ПеремещениеЗапасовЗапасы.Ссылка
	//	|ГДЕ
	//	|	алк_ПеремещениеЗапасов.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Перемещения.Дата КАК Период,
	//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//	|	ВТ_Перемещения.ВидОперации КАК ВидОперации,
	//	|	ВТ_Перемещения.ДатаСмены КАК ДатаСмены,
	//	|	ВТ_Перемещения.Смена КАК Смена,
	//	|	ВТ_Перемещения.Организация КАК Организация,
	//	|	ВТ_Перемещения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|	ВТ_Перемещения.Штабель КАК Штабель,
	//	|	ВТ_Перемещения.Номенклатура КАК Номенклатура,
	//	|	ВТ_Перемещения.СерийныйНомер КАК СерийныйНомер,
	//	|	ВТ_Перемещения.Характеристика КАК Характеристика,
	//	|	ВТ_Перемещения.Сертификат КАК Сертификат,
	//	|	ВТ_Перемещения.Объем КАК Количество
	//	|ИЗ
	//	|	ВТ_Перемещения КАК ВТ_Перемещения
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТ_Перемещения.Дата,
	//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	//	|	ВТ_Перемещения.ВидОперации,
	//	|	ВТ_Перемещения.ДатаСмены,
	//	|	ВТ_Перемещения.Смена,
	//	|	ВТ_Перемещения.Организация,
	//	|	ВТ_Перемещения.СтруктурнаяЕдиницаПолучатель,
	//	|	ВТ_Перемещения.ШтабельПолучатель,
	//	|	ВТ_Перемещения.Номенклатура,
	//	|	ВТ_Перемещения.СерийныйНомер,
	//	|	ВТ_Перемещения.Характеристика,
	//	|	ВТ_Перемещения.Сертификат,
	//	|	ВТ_Перемещения.Объем
	//	|ИЗ
	//	|	ВТ_Перемещения КАК ВТ_Перемещения
	//	|ГДЕ
	//	|	ВТ_Перемещения.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки)
	//	|	И ВТ_Перемещения.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства)";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	//	Запрос.УстановитьПараметр("ПериодыСерийныхНомеров", РфпСервер.ПолучитьПоследнийПериодПакета(ДокументСсылкаПеремещениеЗапасов
	//	,ДокументСсылкаПеремещениеЗапасов.Дата,ДокументСсылкаПеремещениеЗапасов.ДатаСмены,ДокументСсылкаПеремещениеЗапасов.Смена
	//	,ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница,ДокументСсылкаПеремещениеЗапасов.Штабель
	//	,ДокументСсылкаПеремещениеЗапасов.Запасы,ДокументСсылкаПеремещениеЗапасов.Участок));
	//
	//	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();	
	//	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаРезультата);
	//
	//КонецПроцедуры
	//
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослПродукция(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);

		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасов.Ссылка.Организация КАК Организация,
		|	&Период,
		|	алк_ПеремещениеЗапасов.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ПеремещениеЗапасов.Ссылка.Смена КАК Смена,
		|	0 КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов КАК алк_ПеремещениеЗапасов
		|ГДЕ
		|	алк_ПеремещениеЗапасов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПеремещениеЗапасов.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
				
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослПродукция", тРезультат);
		
	КонецПроцедуры // СформироватьТаблицаДокументыПослПродукция
	
	#КонецОбласти 
	
	
	#Область ИнтерфейсПечати
	
	// Функция формирует печатную форму документа по указанному макету.
	//
	// Параметры:
	//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
	//				   форма.
	//  ИмяМакета    - Строка, имя макета печатной формы.
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	
	Функция ДанныеБланкаТоварногоНаполнения(МассивОбъектов, ОбъектыПечати)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасов.Ссылка,
		|	""Оприходование на СГП"" КАК ПредставлениеРегистратора,
		|	алк_ПеремещениеЗапасов.Дата КАК ДатаДокумента,
		|	алк_ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК ПредставлениеСклада,
		|	алк_ПеремещениеЗапасов.Номер,
		|	алк_ПеремещениеЗапасов.Ячейка КАК ПредставлениеЯчейки,
		|	алк_ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
		|	""Запасы"" КАК ТипНоменклатурыТаблицы,
		|	алк_ПеремещениеЗапасов.Запасы.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура.Наименование КАК ПредставлениеНоменклатуры,
		|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|		ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЗапасов.Запасы.СерийныйНомер) КАК Пакет,
		|		СерийныйНомер
		|	) КАК ТаблицаЗапасы
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов КАК алк_ПеремещениеЗапасов
		|ГДЕ
		|	алк_ПеремещениеЗапасов.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецФункции // ДанныеБланкаТоварногоНаполнения()
	
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Приходная накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Накладная"));
			
		КонецЕсли;
		
		ОписаниеПечатнойФормы = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполнения");
		Если ОписаниеПечатнойФормы <> Неопределено Тогда
			
			ОписаниеПечатнойФормы.ТабличныйДокумент = Новый ТабличныйДокумент;
			ОписаниеПечатнойФормы.ТабличныйДокумент.КлючПараметровПечати = Обработки.алк_ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
			ОписаниеПечатнойФормы.ПолныйПутьКМакету = Обработки.алк_ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
			ОписаниеПечатнойФормы.СинонимМакета = Обработки.алк_ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
			
			ДанныеОбъектовПечати = ДанныеБланкаТоварногоНаполнения(МассивОбъектов, ОбъектыПечати);
			Обработки.алк_ПечатьБланкТоварногоНаполнения.алк_СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати);
			
		КонецЕсли;
		
	КонецПроцедуры // Печать()
	
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Накладная";
		КомандаПечати.Представление = НСтр("ru = 'Приходная накладная'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
		КомандаПечати.Представление = Обработки.алк_ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 10;
		
		
	КонецПроцедуры // ДобавитьКомандыПечати()
	
	
	
	#КонецОбласти
	
	
#КонецЕсли
